04_OpenFoam/_ref/OpenFOAM-14/shockFluid/movingCone/Allrun-parallel
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

runApplication blockMesh
runApplication decomposePar -cellProc

for mapTime in 1e-05 2e-05
do
    runApplication -s $mapTime blockMesh -mesh $mapTime
    ln -s meshes/$mapTime/decomposeParDict system/decomposeParDict
    runApplication -s $mapTime decomposePar -mesh $mapTime
    rm -f system/decomposeParDict
done

runParallel foamRun
runApplication reconstructPar -cellProc

#------------------------------------------------------------------------------
